i46 - Almost done with README
